{
  "blog": [
    {
      "id": "799701704230",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "799701704230",
      "m_entry_header": "History of personal computers",
      "m_entry_text": "The history of the personal computer as a mass-market consumer electronic device began with the microcomputer revolution of the 1970s. A personal computer is one intended for interactive individual use, as opposed to a mainframe computer where the end user's requests are filtered through operating staff, or a time-sharing system in which one large processor is shared by many individuals. After the development of the microprocessor, individual personal computers were low enough in cost that they eventually became affordable consumer goods. Early personal computers – generally called microcomputers – were sold often in electronic kit form and in limited numbers, and were of interest mostly to hobbyists and technicians.\n\n    The history of the personal computer as mass-market consumer electronic devices effectively began in 1977 with the introduction of microcomputers, although some mainframe and minicomputers had been applied as single-user systems much earlier. A personal computer is one intended for interactive individual use, as opposed to a mainframe computer where the end user's requests are filtered through operating staff, or a time sharing system in which one large processor is shared by many individuals. After the development of the microprocessor, individual personal computers were low enough in cost that they eventually became affordable consumer goods. Early personal computers – generally called microcomputers – were sold often in electronic kit form and in limited numbers, and were of interest mostly to hobbyists and technicians.\n\n    ",
      "m_entry_date_number": 20250904,
      "m_entry_date_string": "04.09.2025"
    },
    {
      "id": "882621712005",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "882621712005",
      "m_entry_header": "Apple II (original)",
      "m_entry_text": "The Apple II (stylized as apple ][) is a personal computer released by Apple Inc. in June 1977. It was one of the first successful mass-produced microcomputer products and is widely regarded as one of the most important personal computers of all time due to its role in popularizing home computing and influencing later software development.[3][4][5][6][7]\n\nThe Apple II was designed primarily by Steve Wozniak. The system is based around the 8-bit MOS Technology 6502 microprocessor. Jerry Manock designed the foam-molded plastic case,[8] Rod Holt developed the switching power supply,[9] while Steve Jobs was not involved in the design of the computer.[10] It was introduced by Jobs and Wozniak at the 1977 West Coast Computer Faire, and marks Apple's first launch of a computer aimed at a consumer market—branded toward American households rather than businessmen or computer hobbyists.[11]\nThe three computers that Byte magazine referred to as the \"1977 Trinity\" of home computing: Commodore PET 2001, Apple II, and TRS-80 Model I\n\nByte magazine referred to the Apple II, Commodore PET 2001, and TRS-80 as the \"1977 Trinity\".[12] As the Apple II had the defining feature of being able to display color graphics, the Apple logo was redesigned to have a spectrum of colors.[13][14]\n\nThe Apple II was the first in a series of computers collectively referred to by the Apple II name. It was followed by the Apple II+, Apple IIe, Apple IIc, Apple IIc Plus, and the 16-bit Apple IIGS—all of which remained compatible. Production of the last available model, the Apple IIe, ceased in November 1993.",
      "m_entry_date_number": 20250704,
      "m_entry_date_string": "04.07.2025"
    },
    {
      "id": "412472323584",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "412472323584",
      "m_entry_header": "Commodore PET",
      "m_entry_text": "The Commodore PET is a line of personal computers produced starting in 1977 by Commodore International.[3] A single all-in-one case combines a MOS Technology 6502 microprocessor, Commodore BASIC in read-only memory, keyboard, monochrome monitor, and, in early models, a cassette deck.\n\nDevelopment of the system began in 1976, and it was demonstrated and sold as the first personal computer for the masses at the January 1977 Consumer Electronics Show.[1] The name \"PET\" was suggested by Andre Souson after he saw the Pet Rock in Los Gatos, and stated they were going to make the \"pet computer\".[5] It was backronymed to Personal Electronic Transactor. In a 1995 retrospective, Byte magazine—and subsequently many others—referred to the PET, Apple II and TRS-80 collectively as the \"1977 trinity\" of pioneering personal computers. [6]\n\nFollowing the initial PET 2001, the design was updated through a series of models with more memory, better keyboard, larger screen, and other modifications. The systems were a top seller in the Canadian and United States education markets, as well as for business use in Europe.\n\nThe PET line was discontinued in 1982 after approximately 219,000 machines were sold. ",
      "m_entry_date_number": 20250504,
      "m_entry_date_string": "04.05.2025"
    },
    {
      "id": "191489570700",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "191489570700",
      "m_entry_header": "Commodore 64ssssssssssssssssss",
      "m_entry_text": "The Commodore 64, also known as the C64, is an 8-bit home computer introduced in January 1982 by Commodore International (first shown at the Consumer Electronics Show, January 7–10, 1982, in Las Vegas).[4] It has been listed in the Guinness World Records as the best-selling desktop computer model of all time,[5] with independent estimates placing the number sold between 12.5 and 17 million units.[2] Volume production started in early 1982, marketing in August for US$595 (equivalent to $1,940 in 2024).[6] Preceded by the VIC-20 and Commodore PET, the C64 took its name from its 64 kilobytes (65,536 bytes) of RAM. With support for multicolor sprites and a custom chip for waveform generation, the C64 could create superior visuals and audio compared to systems without such custom hardware.\n\n\n\nThe C64 dominated the low-end computer market (except in the UK, France and Japan, lasting only about six months in Japan[7]) for most of the later years of the 1980s.[8] For a substantial period (1983–1986), the C64 had between 30% and 40% share of the US market and two million units sold per year,[9] outselling IBM PC compatibles, the Apple II, and Atari 8-bit computers. Sam Tramiel, a later Atari president and the son of Commodore's founder, said in a 1989 interview, \"When I was at Commodore we were building 400,000 C64s a month for a couple of years.\"[10] In the UK market, the C64 faced competition from the BBC Micro, the ZX Spectrum, and later the Amstrad CPC 464,[11] but the C64 was still the second-most-popular computer in the UK after the ZX Spectrum.[12] The Commodore 64 failed to make any impact in Japan, as their market was dominated by Japanese computers, such as the NEC PC-8801, Sharp X1, Fujitsu FM-7 and MSX,[13] and in France, where the ZX Spectrum, Thomson MO5 and TO7, and Amstrad CPC 464 dominated the market.[14]\n\nPart of the Commodore 64's success was its sale in regular retail stores instead of only electronics or computer hobbyist specialty stores. Commodore produced many of its parts in-house to control costs, including custom integrated circuit chips from MOS Technology. In the United States, it has been compared to the Ford Model T automobile for its role in bringing a new technology to middle-class households via creative and affordable mass-production.[15] Approximately 10,000 commercial software titles have been made for the Commodore 64, including development tools, office productivity applications, and video games.[16] C64 emulators allow anyone with a modern computer, or a compatible video game console, to run these programs today. The C64 is also credited with popularizing the computer demoscene and is still used today by some computer hobbyists.[17] In 2011, 17 years after it was taken off the market, research showed that brand recognition for the model was still at 87%.",
      "m_entry_date_number": 20250404,
      "m_entry_date_string": "04.04.2025"
    },
    {
      "id": "1418131382636",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1418131382636",
      "m_entry_header": "TRS-80",
      "m_entry_text": "The TRS-80 Micro Computer System (TRS-80, later renamed the Model I to distinguish it from successors) is a desktop microcomputer developed by American company Tandy Corporation and sold through their Radio Shack stores. Launched in 1977, it is one of the earliest mass-produced and mass-marketed retail home computers.[4] The name is an abbreviation of Tandy Radio Shack, Z80 [microprocessor], referring to its Zilog Z80 8-bit microprocessor.[5]\n\nThe TRS-80 has a full-stroke QWERTY keyboard, 4 KB dynamic random-access memory (DRAM) standard memory, small size and desk area, floating-point Level I BASIC language interpreter in read-only memory (ROM), 64-character-per-line video monitor, and had a starting price of US$600[1] (equivalent to US$3,100 in 2024). A cassette tape drive for program storage was included in the original package. While the software environment was stable, the cassette load/save process combined with keyboard bounce issues and a troublesome Expansion Interface contributed to the Model I's reputation as not well-suited for serious use. Initially (until 1981), it lacked support for lowercase characters which may have hampered business adoption. An extensive line of upgrades and add-on hardware peripherals for the TRS-80 was developed and marketed by Tandy/Radio Shack. The basic system can be expanded with up to 48 KB of RAM (in 16 KB increments), and up to four floppy disk drives and/or hard disk drives. Tandy/Radio Shack provided full-service support including upgrade, repair, and training services in their thousands of stores worldwide.\n\nBy 1979, the TRS-80 had the largest selection of software in the microcomputer market.[6] Until 1982, the TRS-80 was the bestselling PC line, outselling the Apple II by a factor of five according to one analysis.[5] The broadly compatible TRS-80 Model III was released in the middle of 1980. The Model I was discontinued shortly thereafter, primarily due to stricter Federal Communications Commission (FCC) regulations on radio-frequency interference to nearby electronic devices.[7][8] In April 1983, the Model III was succeeded by the compatible TRS-80 Model 4. Following the original Model I and its compatible descendants, the TRS-80 name became a generic brand used on other unrelated computer lines sold by Tandy, including the TRS-80 Model II, TRS-80 Model 2000, TRS-80 Model 100, TRS-80 Color Computer, and TRS-80 Pocket Computer. ",
      "m_entry_date_number": 20250304,
      "m_entry_date_string": "04.03.2025"
    },
    {
      "id": "886548307134",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "886548307134",
      "m_entry_header": "Altair 8800",
      "m_entry_text": "The Altair 8800 is a microcomputer introduced in 1974 by Micro Instrumentation and Telemetry Systems (MITS) based on the Intel 8080 CPU.[2] It was the first commercially successful personal computer.[3] Interest in the Altair 8800 grew quickly after it was featured on the cover of the January 1975 issue of Popular Electronics.[4] It was sold by mail order through advertisements in Popular Electronics, Radio-Electronics, and in other hobbyist magazines.[5][6] The Altair 8800 had no built-in screen or video output, so it would have to be connected to a serial terminal or teletype to have any output. To connect it to a terminal, a serial interface card had to be installed. Alternatively, the Altair could be programmed using its front-panel switches.\n\nAccording to the personal computer pioneer Harry Garland, the Altair 8800 was the product that catalyzed the microcomputer revolution of the 1970s.[7] The computer bus designed for the Altair became a de facto standard in the form of the S-100 bus, and the first programming language for the machine was Microsoft's founding product, Altair BASIC.[8][9]\n\nHistory\nThis \"Tracking Light for Model Rockets\" project appeared in the September 1969 issue of Model Rocketry and was the first kit sold by MITS.\n\nWhile serving at the Air Force Weapons Laboratory at Kirtland Air Force Base, Ed Roberts and Forrest M. Mims III decided to use their electronics background to produce small kits for model rocket hobbyists. In 1969, Roberts and Mims, along with Stan Cagle and Robert Zaller, founded Micro Instrumentation and Telemetry Systems (MITS) in Roberts' garage in Albuquerque, New Mexico, and started selling radio transmitters and instruments for model rockets.\n\nCalculators\n\nThe model rocket kits were a modest success and MITS wanted to try a kit that would appeal to more hobbyists. The November 1970 issue of Popular Electronics featured the Opticom, a kit from MITS that would send voice over an LED light beam. As Mims and Cagle were losing interest in the kit business, Roberts bought his partners out and began developing a calculator kit. Electronic Arrays had just announced the EAS100, a set of six large scale integrated (LSI) circuit chips that would make a four-function calculator.[10] The MITS 816 calculator kit used the chipset and was featured on the November 1971 cover of Popular Electronics. This calculator kit sold for $175, or $275 assembled.[11] Forrest Mims wrote the assembly manual for this kit and many others over the next several years. As payment for each manual he often accepted a copy of the kit.\n\nThe calculator was successful and was followed by several improved models. The MITS 1440 calculator was featured in the July 1973 issues of Radio-Electronics. It had a 14-digit display, memory, and square root function. The kit sold for $200 and the assembled version was $250.[12] MITS later developed a programmer unit that would connect to the 816 or 1440 calculator and allow programs of up to 256 steps.[13]\n\nIn 1972, Texas Instruments developed its own calculator chip and started selling complete calculators at less than half the price of other commercial models. MITS and many other companies were devastated by this, and Roberts struggled to reduce his quarter-million-dollar debt.\n\nIn January 1972, Popular Electronics merged with another Ziff-Davis magazine, Electronics World. The change in editorial staff upset many of their authors, and they started writing for a competing magazine, Radio-Electronics. In 1972 and 1973, some of the best construction projects appeared in Radio-Electronics.\n\nIn 1974, Art Salsberg became editor of Popular Electronics. It was Salsberg's goal to reclaim the lead in electronics projects. He was impressed with Don Lancaster's TV Typewriter (Radio Electronics, September 1973) article and wanted computer projects for Popular Electronics. Don Lancaster did an ASCII keyboard for Popular Electronics in April 1974. They were evaluating a computer trainer project by Jerry Ogden when the Mark-8 8008-based computer by Jonathan Titus appeared on the July 1974 cover of Radio-Electronics. The computer trainer was put on hold and the editors looked for a real computer system. (Popular Electronics gave Jerry Ogden a column, Computer Bits, starting in June 1975.)[14]\n\nOne of the editors, Les Solomon, knew MITS was working on an Intel 8080 based computer project and thought Roberts could provide the project for the always popular January issue. In a last-ditch attempt to save MITS, Roberts decided to do something that was impossible at the time: create a personal computer kit for hobbyists.[15] The TV Typewriter and the Mark-8 computer projects were just a detailed set of plans and a set of bare printed circuit boards. The hobbyist faced the daunting task of acquiring all of the integrated circuits and other components. The editors of Popular Electronics wanted a complete kit in a professional-looking enclosure.[16]\n\nEd Roberts and his head engineer, Bill Yates, finished the first prototype in October 1974 and shipped it to Popular Electronics in New York via the Railway Express Agency. However, it never arrived due to a strike by the shipping company. Solomon already had a number of pictures of the machine and the article was based on them. Roberts got to work on building a replacement. The computer on the magazine cover is an empty box with just switches and LEDs on the front panel. The finished Altair computer had a completely different circuit board layout than the prototype shown in the magazine.[17] The January 1975 issue was registered on November 29, 1974,[18] and began appearing on newsstands on December 19, 1974—during the week before Christmas of 1974[19][16][20][21]—at which point the kit was officially (if not yet practically) available for sale.[14][16][18]\n",
      "m_entry_date_number": 20250204,
      "m_entry_date_string": "04.02.2025"
    },
    {
      "id": "112168176794",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "112168176794",
      "m_entry_header": "BBC Micro",
      "m_entry_text": "The BBC Microcomputer System, or BBC Micro, is a family of microcomputers developed and manufactured by Acorn Computers in the early 1980s as part of the BBC's Computer Literacy Project. Launched in December 1981, it was showcased across several educational BBC television programmes, such as The Computer Programme (1982), Making the Most of the Micro and Computers in Control (both 1983), and Micro Live (1985). Created in response to the BBC's call for bids for a microcomputer to complement its broadcasts and printed material, Acorn secured the contract with its rapidly prototyped \"Proton\" system, which was subsequently renamed the BBC Micro.\n\nAlthough it was announced towards the end of 1981, production issues initially delayed the fulfilment of many orders, causing deliveries to spill over into 1982. Nicknamed the \"Beeb\", it soon became a fixture in British schools, advancing the BBC's goal of improving computer literacy. Renowned for its strong build quality and extensive connectivity, including ports for peripherals, support for Econet networking, and the option of second processors via the Tube interface, the BBC Micro was offered in two main variants: the 16 KB Model A (initially priced at £299) and the more popular 32 KB Model B (priced at £399). Although it was costlier than many other home computers of the era, it sold over 1.5 million units, boosted by the BBC's brand recognition and the machine's adaptability.\n\nThe BBC Micro's impact on education in the United Kingdom was notable, with most schools in Britain acquiring at least one unit, exposing a generation of pupils to computing fundamentals. Central to this was its built-in BBC BASIC programming language, known for its robust feature set and accessible syntax. As a home system, the BBC also fostered a community of enthusiasts who benefited from its flexible architecture, which supported everything from disk interfaces to speech synthesis. Through these expansions and its broader software library, the BBC Micro had a major impact in the development of the UK's home-grown software industry. Acorn's engineers used the BBC Micro as both a development platform and a reference design to simulate their pioneering ARM architecture, now one of the most widely deployed CPU designs worldwide. This work influenced the rapid evolution of RISC-based processing in mobile devices, embedded systems, and beyond, making the BBC Micro an important stepping stone in computing.\n\nThe BBC Micro had multiple display modes, including a Teletext-based Mode 7 that used minimal memory, and came with a full-travel keyboard and ten user-configurable function keys. Hardware interfaces were catered for with standard analogue inputs, a serial and parallel port, and a cassette interface that followed the CUTS (Computer Users' Tape Standard) variation of the Kansas City standard. In total, nine BBC-branded microcomputer models were released, although the term \"BBC Micro\" generally refers to the first six versions (Model A, B, B+64, B+128, Master 128, and Master Compact). Later BBC models are typically classed as part of Acorn's Archimedes line.",
      "m_entry_date_number": 20250104,
      "m_entry_date_string": "04.01.2025"
    },
    {
      "id": "592737473828",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "592737473828",
      "m_entry_header": "Blog Nr 9",
      "m_entry_text": "Text Nr 9",
      "m_entry_date_number": 20241204,
      "m_entry_date_string": "04.12.2024"
    },
    {
      "id": "1659431191533",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1659431191533",
      "m_entry_header": "Blog Nr 10",
      "m_entry_text": "Text Nr 10",
      "m_entry_date_number": 20241104,
      "m_entry_date_string": "04.11.2024"
    },
    {
      "id": "1471305362344",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1471305362344",
      "m_entry_header": "Blog Nr 11",
      "m_entry_text": "Text Nr 11",
      "m_entry_date_number": 20241004,
      "m_entry_date_string": "04.10.2024"
    },
    {
      "id": "1562701984000",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1562701984000",
      "m_entry_header": "Blog Nr 12",
      "m_entry_text": "Text Nr 12",
      "m_entry_date_number": 20240904,
      "m_entry_date_string": "04.09.2024"
    },
    {
      "id": "1289952167647",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1289952167647",
      "m_entry_header": "Blog Nr 13",
      "m_entry_text": "Text Nr 13",
      "m_entry_date_number": 20240804,
      "m_entry_date_string": "04.08.2024"
    },
    {
      "id": "1740169502502",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1740169502502",
      "m_entry_header": "Blog Nr 14",
      "m_entry_text": "Text Nr 14",
      "m_entry_date_number": 20240704,
      "m_entry_date_string": "04.07.2024"
    },
    {
      "id": "162957470612",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "162957470612",
      "m_entry_header": "Blog Nr 15",
      "m_entry_text": "Text Nr 15",
      "m_entry_date_number": 20240604,
      "m_entry_date_string": "04.06.2024"
    },
    {
      "id": "678150015287",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "678150015287",
      "m_entry_header": "Blog Nr 16",
      "m_entry_text": "Text Nr 16",
      "m_entry_date_number": 20240504,
      "m_entry_date_string": "04.05.2024"
    },
    {
      "id": "461205888313",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "461205888313",
      "m_entry_header": "Blog Nr 17",
      "m_entry_text": "Text Nr 17",
      "m_entry_date_number": 20240404,
      "m_entry_date_string": "04.04.2024"
    },
    {
      "id": "378996189826",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "378996189826",
      "m_entry_header": "Blog Nr 18",
      "m_entry_text": "Text Nr 18",
      "m_entry_date_number": 20240304,
      "m_entry_date_string": "04.03.2024"
    },
    {
      "id": "178156129786",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "178156129786",
      "m_entry_header": "Blog Nr 19",
      "m_entry_text": "Text Nr 19",
      "m_entry_date_number": 20240204,
      "m_entry_date_string": "04.02.2024"
    },
    {
      "id": "1630258923066",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1630258923066",
      "m_entry_header": "Blog Nr 20",
      "m_entry_text": "Text Nr 20",
      "m_entry_date_number": 20240104,
      "m_entry_date_string": "04.01.2024"
    },
    {
      "id": "686081077585",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "686081077585",
      "m_entry_header": "Blog Nr 21",
      "m_entry_text": "Text Nr 21",
      "m_entry_date_number": 20231204,
      "m_entry_date_string": "04.12.2023"
    },
    {
      "id": "1435121126760",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1435121126760",
      "m_entry_header": "Blog Nr 22",
      "m_entry_text": "Text Nr 22",
      "m_entry_date_number": 20231104,
      "m_entry_date_string": "04.11.2023"
    },
    {
      "id": "1300707259646",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1300707259646",
      "m_entry_header": "Blog Nr 23",
      "m_entry_text": "Text Nr 23",
      "m_entry_date_number": 20231004,
      "m_entry_date_string": "04.10.2023"
    },
    {
      "id": "452476660703",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "452476660703",
      "m_entry_header": "Blog Nr 24",
      "m_entry_text": "Text Nr 24",
      "m_entry_date_number": 20230904,
      "m_entry_date_string": "04.09.2023"
    },
    {
      "id": "1059894506727",
      "m_user_id": 2,
      "m_user_name": "stpanr",
      "m_entry_id": "1059894506727",
      "m_entry_header": "ddddddddddd",
      "m_entry_text": "dddddddddddddddd",
      "m_entry_date_number": 20250815,
      "m_entry_date_string": "15.09.2025"
    }
  ]
}