{
  "blog": [
    {
      "id": "285051383108",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "285051383108",
      "m_entry_header": "ZX Spectrum",
      "m_entry_text": "The ZX Spectrum (UK: /zɛd ɛks/) is an 8-bit home computer developed and marketed by Sinclair Research. The Spectrum played a pivotal role in the history of personal computers and video games, especially in the United Kingdom. It was one of the all-time bestselling British computers with over five million units sold. It was released in the UK on 23 April 1982, the United States in 1983, and Europe in 1984.\n\nThe machine was designed by the English entrepreneur and inventor Sir Clive Sinclair and his small team in Cambridge, and was manufactured in Dundee, Scotland by Timex Corporation.[5] It was made to be small, simple, and most importantly inexpensive, with as few components as possible. The addendum \"Spectrum\" was chosen to highlight the machine's colour display, which differed from the black-and-white display of its predecessor, the ZX81. Rick Dickinson designed its distinctive case, rainbow motif, and rubber keyboard. Video output is transmitted to a television set rather than a dedicated monitor, while application software is loaded and saved onto compact audio cassettes.\n\nThe ZX Spectrum was initially distributed by mail order, but after severe backlogs it was sold through High Street chains in the United Kingdom. It was released in the US as the Timex Sinclair 2068 in 1983, and in some parts of Europe as the Timex Computer 2048. There are seven models overall, ranging from the entry level with 16 KB RAM released in 1982 to the ZX Spectrum +3 with 128 KB RAM and built-in floppy disk drive in 1987. The machine primarily competed with the Commodore 64, BBC Micro, Dragon 32, and the Amstrad CPC range. Over 24,000 software products were released for the ZX Spectrum.[1]\n\nIts introduction led to a boom in companies producing software and hardware, the effects of which are still seen. It was among the first home computers aimed at a mainstream UK audience, with some crediting it for launching the British information technology industry. The Spectrum was Britain's top-selling computer until the Amstrad PCW surpassed it in the 1990s.[6][7][8] It was discontinued in 1992. ",
      "m_entry_date_number": 20250804,
      "m_entry_date_string": "04.08.2025"
    },
    {
      "id": "911568090905",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "911568090905",
      "m_entry_header": "Amiga 500",
      "m_entry_text": "The Amiga 500, also known as the A500, was the first popular version of the Amiga home computer, \"redefining the home computer market and making so-called luxury features such as multitasking and colour a standard long before Microsoft or Apple sold these to the masses.\"[2] It contains the same Motorola 68000 as the Amiga 1000, as well as the same graphics and sound coprocessors, but is in a smaller case similar to that of the Commodore 128.\n\nCommodore announced the Amiga 500 at the January 1987 winter Consumer Electronics Show – at the same time as the high-end Amiga 2000. It was initially available in the Netherlands in April 1987, then the rest of Europe in May.[3] In North America and the UK it was released in October 1987 with a US$699/£499 list price. It competed directly against models in the Atari ST line.\n\nThe Amiga 500 was sold in the same retail outlets as the Commodore 64, as opposed to the computer store-only Amiga 1000. It proved to be Commodore's best-selling model, particularly in Europe.[4] Although popular with hobbyists, arguably its most widespread use was as a gaming machine, where its graphics and sound were of significant benefit. It was followed by a revised version of the computer, the Amiga 500 Plus, and the 500 series was discontinued in 1992. ",
      "m_entry_date_number": 20250604,
      "m_entry_date_string": "04.06.2025"
    },
    {
      "id": "191489570700",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "191489570700",
      "m_entry_header": "Commodore 64",
      "m_entry_text": "The Commodore 64, also known as the C64, is an 8-bit home computer introduced in January 1982 by Commodore International (first shown at the Consumer Electronics Show, January 7–10, 1982, in Las Vegas).[4] It has been listed in the Guinness World Records as the best-selling desktop computer model of all time,[5] with independent estimates placing the number sold between 12.5 and 17 million units.[2] Volume production started in early 1982, marketing in August for US$595 (equivalent to $1,940 in 2024).[6] Preceded by the VIC-20 and Commodore PET, the C64 took its name from its 64 kilobytes (65,536 bytes) of RAM. With support for multicolor sprites and a custom chip for waveform generation, the C64 could create superior visuals and audio compared to systems without such custom hardware.\n\n\n\nThe C64 dominated the low-end computer market (except in the UK, France and Japan, lasting only about six months in Japan[7]) for most of the later years of the 1980s.[8] For a substantial period (1983–1986), the C64 had between 30% and 40% share of the US market and two million units sold per year,[9] outselling IBM PC compatibles, the Apple II, and Atari 8-bit computers. Sam Tramiel, a later Atari president and the son of Commodore's founder, said in a 1989 interview, \"When I was at Commodore we were building 400,000 C64s a month for a couple of years.\"[10] In the UK market, the C64 faced competition from the BBC Micro, the ZX Spectrum, and later the Amstrad CPC 464,[11] but the C64 was still the second-most-popular computer in the UK after the ZX Spectrum.[12] The Commodore 64 failed to make any impact in Japan, as their market was dominated by Japanese computers, such as the NEC PC-8801, Sharp X1, Fujitsu FM-7 and MSX,[13] and in France, where the ZX Spectrum, Thomson MO5 and TO7, and Amstrad CPC 464 dominated the market.[14]\n\nPart of the Commodore 64's success was its sale in regular retail stores instead of only electronics or computer hobbyist specialty stores. Commodore produced many of its parts in-house to control costs, including custom integrated circuit chips from MOS Technology. In the United States, it has been compared to the Ford Model T automobile for its role in bringing a new technology to middle-class households via creative and affordable mass-production.[15] Approximately 10,000 commercial software titles have been made for the Commodore 64, including development tools, office productivity applications, and video games.[16] C64 emulators allow anyone with a modern computer, or a compatible video game console, to run these programs today. The C64 is also credited with popularizing the computer demoscene and is still used today by some computer hobbyists.[17] In 2011, 17 years after it was taken off the market, research showed that brand recognition for the model was still at 87%.",
      "m_entry_date_number": 20250404,
      "m_entry_date_string": "04.04.2025"
    },
    {
      "id": "886548307134",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "886548307134",
      "m_entry_header": "Altair 8800",
      "m_entry_text": "The Altair 8800 is a microcomputer introduced in 1974 by Micro Instrumentation and Telemetry Systems (MITS) based on the Intel 8080 CPU.[2] It was the first commercially successful personal computer.[3] Interest in the Altair 8800 grew quickly after it was featured on the cover of the January 1975 issue of Popular Electronics.[4] It was sold by mail order through advertisements in Popular Electronics, Radio-Electronics, and in other hobbyist magazines.[5][6] The Altair 8800 had no built-in screen or video output, so it would have to be connected to a serial terminal or teletype to have any output. To connect it to a terminal, a serial interface card had to be installed. Alternatively, the Altair could be programmed using its front-panel switches.\n\nAccording to the personal computer pioneer Harry Garland, the Altair 8800 was the product that catalyzed the microcomputer revolution of the 1970s.[7] The computer bus designed for the Altair became a de facto standard in the form of the S-100 bus, and the first programming language for the machine was Microsoft's founding product, Altair BASIC.[8][9]\n\nHistory\nThis \"Tracking Light for Model Rockets\" project appeared in the September 1969 issue of Model Rocketry and was the first kit sold by MITS.\n\nWhile serving at the Air Force Weapons Laboratory at Kirtland Air Force Base, Ed Roberts and Forrest M. Mims III decided to use their electronics background to produce small kits for model rocket hobbyists. In 1969, Roberts and Mims, along with Stan Cagle and Robert Zaller, founded Micro Instrumentation and Telemetry Systems (MITS) in Roberts' garage in Albuquerque, New Mexico, and started selling radio transmitters and instruments for model rockets.\n\nCalculators\n\nThe model rocket kits were a modest success and MITS wanted to try a kit that would appeal to more hobbyists. The November 1970 issue of Popular Electronics featured the Opticom, a kit from MITS that would send voice over an LED light beam. As Mims and Cagle were losing interest in the kit business, Roberts bought his partners out and began developing a calculator kit. Electronic Arrays had just announced the EAS100, a set of six large scale integrated (LSI) circuit chips that would make a four-function calculator.[10] The MITS 816 calculator kit used the chipset and was featured on the November 1971 cover of Popular Electronics. This calculator kit sold for $175, or $275 assembled.[11] Forrest Mims wrote the assembly manual for this kit and many others over the next several years. As payment for each manual he often accepted a copy of the kit.\n\nThe calculator was successful and was followed by several improved models. The MITS 1440 calculator was featured in the July 1973 issues of Radio-Electronics. It had a 14-digit display, memory, and square root function. The kit sold for $200 and the assembled version was $250.[12] MITS later developed a programmer unit that would connect to the 816 or 1440 calculator and allow programs of up to 256 steps.[13]\n\nIn 1972, Texas Instruments developed its own calculator chip and started selling complete calculators at less than half the price of other commercial models. MITS and many other companies were devastated by this, and Roberts struggled to reduce his quarter-million-dollar debt.\n\nIn January 1972, Popular Electronics merged with another Ziff-Davis magazine, Electronics World. The change in editorial staff upset many of their authors, and they started writing for a competing magazine, Radio-Electronics. In 1972 and 1973, some of the best construction projects appeared in Radio-Electronics.\n\nIn 1974, Art Salsberg became editor of Popular Electronics. It was Salsberg's goal to reclaim the lead in electronics projects. He was impressed with Don Lancaster's TV Typewriter (Radio Electronics, September 1973) article and wanted computer projects for Popular Electronics. Don Lancaster did an ASCII keyboard for Popular Electronics in April 1974. They were evaluating a computer trainer project by Jerry Ogden when the Mark-8 8008-based computer by Jonathan Titus appeared on the July 1974 cover of Radio-Electronics. The computer trainer was put on hold and the editors looked for a real computer system. (Popular Electronics gave Jerry Ogden a column, Computer Bits, starting in June 1975.)[14]\n\nOne of the editors, Les Solomon, knew MITS was working on an Intel 8080 based computer project and thought Roberts could provide the project for the always popular January issue. In a last-ditch attempt to save MITS, Roberts decided to do something that was impossible at the time: create a personal computer kit for hobbyists.[15] The TV Typewriter and the Mark-8 computer projects were just a detailed set of plans and a set of bare printed circuit boards. The hobbyist faced the daunting task of acquiring all of the integrated circuits and other components. The editors of Popular Electronics wanted a complete kit in a professional-looking enclosure.[16]\n\nEd Roberts and his head engineer, Bill Yates, finished the first prototype in October 1974 and shipped it to Popular Electronics in New York via the Railway Express Agency. However, it never arrived due to a strike by the shipping company. Solomon already had a number of pictures of the machine and the article was based on them. Roberts got to work on building a replacement. The computer on the magazine cover is an empty box with just switches and LEDs on the front panel. The finished Altair computer had a completely different circuit board layout than the prototype shown in the magazine.[17] The January 1975 issue was registered on November 29, 1974,[18] and began appearing on newsstands on December 19, 1974—during the week before Christmas of 1974[19][16][20][21]—at which point the kit was officially (if not yet practically) available for sale.[14][16][18]\n",
      "m_entry_date_number": 20250204,
      "m_entry_date_string": "04.02.2025"
    },
    {
      "id": "592737473828",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "592737473828",
      "m_entry_header": "Blog Nr 9",
      "m_entry_text": "Text Nr 9",
      "m_entry_date_number": 20241204,
      "m_entry_date_string": "04.12.2024"
    },
    {
      "id": "1659431191533",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1659431191533",
      "m_entry_header": "Blog Nr 10",
      "m_entry_text": "Text Nr 10",
      "m_entry_date_number": 20241104,
      "m_entry_date_string": "04.11.2024"
    },
    {
      "id": "1471305362344",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1471305362344",
      "m_entry_header": "Blog Nr 11",
      "m_entry_text": "Text Nr 11",
      "m_entry_date_number": 20241004,
      "m_entry_date_string": "04.10.2024"
    },
    {
      "id": "1562701984000",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1562701984000",
      "m_entry_header": "Blog Nr 12",
      "m_entry_text": "Text Nr 12",
      "m_entry_date_number": 20240904,
      "m_entry_date_string": "04.09.2024"
    },
    {
      "id": "1289952167647",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1289952167647",
      "m_entry_header": "Blog Nr 13",
      "m_entry_text": "Text Nr 13",
      "m_entry_date_number": 20240804,
      "m_entry_date_string": "04.08.2024"
    },
    {
      "id": "1740169502502",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1740169502502",
      "m_entry_header": "Blog Nr 14",
      "m_entry_text": "Text Nr 14",
      "m_entry_date_number": 20240704,
      "m_entry_date_string": "04.07.2024"
    },
    {
      "id": "162957470612",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "162957470612",
      "m_entry_header": "Blog Nr 15",
      "m_entry_text": "Text Nr 15",
      "m_entry_date_number": 20240604,
      "m_entry_date_string": "04.06.2024"
    },
    {
      "id": "678150015287",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "678150015287",
      "m_entry_header": "Blog Nr 16",
      "m_entry_text": "Text Nr 16",
      "m_entry_date_number": 20240504,
      "m_entry_date_string": "04.05.2024"
    },
    {
      "id": "461205888313",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "461205888313",
      "m_entry_header": "Blog Nr 17",
      "m_entry_text": "Text Nr 17",
      "m_entry_date_number": 20240404,
      "m_entry_date_string": "04.04.2024"
    },
    {
      "id": "378996189826",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "378996189826",
      "m_entry_header": "Blog Nr 18",
      "m_entry_text": "Text Nr 18",
      "m_entry_date_number": 20240304,
      "m_entry_date_string": "04.03.2024"
    },
    {
      "id": "178156129786",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "178156129786",
      "m_entry_header": "Blog Nr 19",
      "m_entry_text": "Text Nr 19",
      "m_entry_date_number": 20240204,
      "m_entry_date_string": "04.02.2024"
    },
    {
      "id": "1630258923066",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1630258923066",
      "m_entry_header": "Blog Nr 20",
      "m_entry_text": "Text Nr 20",
      "m_entry_date_number": 20240104,
      "m_entry_date_string": "04.01.2024"
    },
    {
      "id": "686081077585",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "686081077585",
      "m_entry_header": "Blog Nr 21",
      "m_entry_text": "Text Nr 21",
      "m_entry_date_number": 20231204,
      "m_entry_date_string": "04.12.2023"
    },
    {
      "id": "1435121126760",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1435121126760",
      "m_entry_header": "Blog Nr 22",
      "m_entry_text": "Text Nr 22",
      "m_entry_date_number": 20231104,
      "m_entry_date_string": "04.11.2023"
    },
    {
      "id": "1300707259646",
      "m_user_id": 2,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "1300707259646",
      "m_entry_header": "Blog Nr 23",
      "m_entry_text": "Text Nr 23",
      "m_entry_date_number": 20231004,
      "m_entry_date_string": "04.10.2023"
    },
    {
      "id": "452476660703",
      "m_user_id": 1,
      "m_user_name": "Admin Workflow",
      "m_entry_id": "452476660703",
      "m_entry_header": "Blog Nr 24",
      "m_entry_text": "Text Nr 24",
      "m_entry_date_number": 20230904,
      "m_entry_date_string": "04.09.2023"
    }
  ]
}